# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of join statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, you'll use the same Customer Relationship Management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [1]:
#Your code here
import pandas as pd
import sqlite3

In [3]:
conn= sqlite3.connect('data.sqlite')
c= conn.cursor()

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle
0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,,President
1,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1,1002,VP Sales
2,1076,Firrelli,Jeff,x9273,jfirrelli@classicmodelcars.com,1,1002,VP Marketing
3,1088,Patterson,William,x4871,wpatterson@classicmodelcars.com,6,1056,Sales Manager (APAC)
4,1102,Bondur,Gerard,x5408,gbondur@classicmodelcars.com,4,1056,Sale Manager (EMEA)

## Display the names of all the employees in Boston.
Hint: join the employees and customers tables.

In [9]:
#Your code here
c.execute('''select lastName, firstName, city
            from employees e
            join customers c
            on e.employeeNumber = c.SalesRepEmployeeNumber
            where city = 'Boston'
            ;''')
df= pd.DataFrame(c.fetchall())
df.columns= [i[0] for i in c.description]
df

    lastName firstName    city
0  Patterson     Steve  Boston
1   Firrelli     Julie  Boston

## Do any offices have no employees?
Hint: Combine the employees and offices tables and use a group by.

In [21]:
#Your code here
c.execute('''select * from employees
            join offices
            using (officeCode)
            ;''')
df= pd.DataFrame(c.fetchall())
df.columns= [i[0] for i in c.description]
len(df)

23

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary

In [ ]:
# Your code here
c.execute('''select from;''')
df= pd.DataFrame(c.fetchall())
df.columns= [i[0] for i in c.description]
df

In [ ]:
# Your code here
c.execute('''select from;''')
df= pd.DataFrame(c.fetchall())
df.columns= [i[0] for i in c.description]
df

In [ ]:
# Your code here
c.execute('''select from;''')
df= pd.DataFrame(c.fetchall())
df.columns= [i[0] for i in c.description]
df

## Level Up: Display the names of each product each employee has sold

In [35]:
# Your code here
c.execute('''select firstName, lastName, productName 
                from employees e
                join customers c
                on e.employeeNumber = c.SalesRepEmployeeNumber
                join orders
                using(customerNumber)
                join orderDetails
                using(orderNumber)
                join products
                using(productCode)
                ''')
df= pd.DataFrame(c.fetchall())
df.columns= [i[0] for i in c.description]
df = df.groupby(df['lastName'])
df.head()

     firstName   lastName                                  productName
0       Leslie   Jennings                               1958 Setra Bus
1       Leslie   Jennings                       1940 Ford Pickup Truck
2       Leslie   Jennings                      1939 Cadillac Limousine
3       Leslie   Jennings  1996 Peterbilt 379 Stake Bed with Outrigger
4       Leslie   Jennings                            1968 Ford Mustang
331     Leslie   Thompson                     1917 Grand Touring Sedan
332     Leslie   Thompson                           1911 Ford Town Car
333     Leslie   Thompson                    1932 Model A Ford J-Coupe
334     Leslie   Thompson          1932 Alfa Romeo 8C2300 Spider Sport
335     Leslie   Thompson                        1957 Ford Thunderbird
445      Julie   Firrelli                     1952 Alpine Renault 1300
446      Julie   Firrelli                       1940 Ford Pickup Truck
447      Julie   Firrelli                  1913 Ford Model T Speedster
448      Julie   Firrelli                           1934 Ford V8 Coupe
449      Julie   Firrelli          18th Century Vintage Horse Carriage
569      Steve  Patterson                            2001 Ferrari Enzo
570      Steve  Patterson                           1969 Corvair Monza
571      Steve  Patterson                             1969 Ford Falcon
572      Steve  Patterson                        1970 Triumph Spitfire
573      Steve  Patterson       1950's Chicago Surface Lines Streetcar
721   Foon Yue      Tseng                            2001 Ferrari Enzo
722   Foon Yue      Tseng                           1969 Corvair Monza
723   Foon Yue      Tseng                             1969 Ford Falcon
724   Foon Yue      Tseng                            1957 Chevy Pickup
725   Foon Yue      Tseng               1998 Chrysler Plymouth Prowler
863     George     Vanauf        1969 Harley Davidson Ultimate Chopper
864     George     Vanauf                        1996 Moto Guzzi 1100i
865     George     Vanauf         2003 Harley-Davidson Eagle Drag Bike
866     George     Vanauf                             2002 Suzuki XREO
867     George     Vanauf          1936 Harley Davidson El Knucklehead
...        ...        ...                                          ...
1919     Larry       Bott                          1972 Alfa Romeo GTA
1920     Larry       Bott                  1980s Black Hawk Helicopter
1921     Larry       Bott                       1999 Yamaha Speed Boat
1922     Larry       Bott      1941 Chevrolet Special Deluxe Cabriolet
1923     Larry       Bott                       1900s Vintage Bi-Plane
2155     Barry      Jones                     1952 Alpine Renault 1300
2156     Barry      Jones                       1962 LanciaA Delta 16V
2157     Barry      Jones                               1958 Setra Bus
2158     Barry      Jones                       1940 Ford Pickup Truck
2159     Barry      Jones                        1926 Ford Fire Engine
2375      Andy     Fixter                        1996 Moto Guzzi 1100i
2376      Andy     Fixter         2003 Harley-Davidson Eagle Drag Bike
2377      Andy     Fixter                               P-51-D Mustang
2378      Andy     Fixter          1936 Harley Davidson El Knucklehead
2379      Andy     Fixter                            1997 BMW R 1100 S
2560     Peter      Marsh                       1962 LanciaA Delta 16V
2561     Peter      Marsh                        1926 Ford Fire Engine
2562     Peter      Marsh                             1940s Ford truck
2563     Peter      Marsh                     1962 Volkswagen Microbus
2564     Peter      Marsh                  1980’s GM Manhattan Express
2745      Mami      Nishi                            2001 Ferrari Enzo
2746      Mami      Nishi                           1969 Corvair Monza
2747      Mami      Nishi                             1969 Ford Falcon
2748      Mami      Nishi                            1903 Ford Model A
2749      Mami      Nishi                     Collectable Wooden Train
2882    Martin     Gerard                                  The Titanic
2883    Martin     Gerard                          1972 Alfa Romeo GTA
2884    Martin     Gerard                       1999 Yamaha Speed Boat
2885    Martin     Gerard      1941 Chevrolet Special Deluxe Cabriolet
2886    Martin     Gerard                          1904 Buick Runabout

[75 rows x 3 columns]

## Level Up: Display the Number of Products each employee has sold

In [ ]:
#Your code here
c.execute('''select from;''')
df= pd.DataFrame(c.fetchall())
df.columns= [i[0] for i in c.description]
df

## Summary

Congrats! You now know how to use join statements, along with leveraging your foreign keys knowledge!